#+PROPERTY: header-args :dir ..
#+PROPERTY: header-args:python

Collect examples for selected meter classes (RNC files are required)
#+begin_src python :results table :session meter-classes
  import sqlite3

  from bs4 import BeautifulSoup

  from velimir.parsers import extract_lines
  from velimir.io import read_poem_xml
  from velimir.validation import meters_to_str
  from velimir.ml_loader import MeterClassRegistry
  from velimir.settings import PREDICTION_DB_PATH

  MeterClassRegistry.initialize()

  meters = [(i, MeterClassRegistry.int_to_mc(i)) for i in range(MeterClassRegistry.num())]
  examples = []

  conn = sqlite3.connect(PREDICTION_DB_PATH)

  for i, mclass in meters:
      res = conn.execute("""
      SELECT poem_path, line_idx
      FROM predictions
      WHERE meter_class_target = ?
      ORDER BY RANDOM()
      """, (i,))

      poem_path, line_id = res.fetchone()

      poem_xml = read_poem_xml(poem_path)
      soup = BeautifulSoup(poem_xml, "xml")
      lines = list(extract_lines(soup))

      line = lines[line_id]
      caesura_repr = "-".join(map(str, mclass.caesura))

      examples.append((line.text, meters_to_str(mclass), caesura_repr or "-", poem_path, meter_class_counter[mclass]))

  examples
#+end_src

#+RESULTS:
| 小褔懈褌邪虁泄 褋 褉芯卸写械虁薪褜褟 胁褉械虁屑褟,                                      | 携     | -   | xviii/lvov/lvov-096           | 1472270 |
| 袛械虁胁褍褕泻懈虁 薪邪 褍虁谢懈褑械虁 褋屑械褞虁褌褋褟,                                     | 啸     | -   | xx/smeliakov/smel-059         |  514430 |
| 袟邪褌褍屑邪虁薪懈谢邪 褋械虁褉写褑械 褍褋褌邪虁谢芯褋褌褜 懈 屑械虁褋褌褜,                          | 袗薪    | -   | xx/blok/blok2-0830            |  210449 |
| 袩褉懈芯褌泻褉褘虁谢 褋胁懈薪褑芯虁胁褍褞 泻褉褘虁褕泻褍,                                   | 袛泻    | -   | xx/emigration/emigr-0958      |  205477 |
| 袙蟹谐谢褟薪褍虁胁 薪邪 褌械斜褟虁 芯蟹邪斜芯虁褔械薪薪芯,                                  | 袗褎    | -   | xx/elagin/elag-330            |  201526 |
| 胁邪虁褋 薪械 芯斜屑邪虁薪械褕褜 褋懈褉械虁薪褜褞 褋褘褉芯虁泄.                                | 袛     | -   | xx/ushakov/ushak-081          |  135253 |
| 袣薪褟蟹械虁泄 懈 谐褉邪虁褎芯胁 懈 褋褔懈褌邪虁褌褜 薪械 卸械谢邪虁褞.                           | 孝泻    | -   | xx/mandelstamm/mandl-344      |   39623 |
| 袙芯虁褌 锌褉芯谢械褌邪虁械褌 袛懈芯虁褉 懈 锌褟虁褌泻芯泄 泻邪褋邪虁械褌褋褟 锌褟虁褌泻懈,                   | 袚械泻   | -   | xx/briusov/brius-1704         |   30943 |
| 袘械蟹谐褉邪虁屑芯褌薪邪褟 懈 斜械褋褎芯虁褉屑械薪薪邪褟!..                                | 袗泻    | -   | xx/1920/1920-318              |   15998 |
| 袧芯 褋屑械褉褌褜 褌邪泻 谐懈斜械谢褜 薪邪锌褉邪虁褋薪褍                                 | 小     | -   | xviii/trediakovsky/tred-041   |   10699 |
| 袗 胁芯虁谢薪褘 锌械虁谢懈: 蟹胁械薪懈虁屑! 蟹胁械薪懈虁屑!                                 | 携~携   | 1/2 | xx/xlebnikov/xlebn-264        |    7627 |
| 效褌芯虁-褌芯 锌芯写褏芯虁写懈褌 斜谢懈虁蟹泻芯, 胁械虁褉薪芯,                                | 袥     | -   | xx/gumilev/gumil-086          |    5749 |
| 袠虁 蟹邪褔械虁屑 屑薪械 蟹薪邪虁褌褜, 褔褌芯虁 锌邪褏薪褍虁谢芯 -- 袧懈虁谢芯屑                       | 啸~啸   | 1/2 | xx/cvetaeva/cvet1-455         |    4966 |
| 孝芯虁谢褜泻芯, 泻邪泻 谢械虁斜械写褜, 芯薪邪虁 褋谢芯虁胁薪芯 薪械 褕谢邪虁, 邪 锌谢褘谢邪虁...             | 袛~袛   | 1/2 | xix/maikov_a/maik-273         |    3738 |
| 袣邪褌懈褋褜 褉邪虁写芯褋褌褜褞 锌芯 锌芯写薪械虁斜械褋褜褞.                                | 袗薪~袗薪 | 1/2 | xix/1790-1810_poets/poets-334 |    1957 |
| 袣 袠虁谢懈写邪虁褉械 斜 薪械虁 谐芯褉械虁谢 褌芯虁谢褜 屑芯泄 薪械虁芯斜褘虁褔薪褘泄.                      | 啸~啸   | 4/7 | xviii/trediakovsky/tred-145   |    1833 |
| 啸芯虁谢芯写薪邪虁 薪邪褕邪虁 锌芯褋褌械虁谢褜:                                         | 啸*    | -   | xx/obolduev/obold-370         |    1095 |
| 袛褘虁屑薪褘械 卸 泻芯虁褉薪懈 写谢褟 蟹械屑谢懈虁 褉芯卸写械薪褘虁.                             | 袛泻    | 1/2 | xx/adobroljubov/adobr-32      |     790 |
| 袙 懈谐褉邪虁褏 械谐芯虁禄.                                                 | 携*    | -   | xviii/xviii_sb/xviii-585      |     525 |
| 小褍虁屑械褉泻懈 褌芯虁谢褜泻芯 锌邪写褍虁褌 -- 胁 写胁械虁褉懈 屑芯懈虁 芯薪 褋褌褍褔懈虁褌褋褟,              | 袩械薪   | -   | xx/schwarz/schwar-066         |     387 |
| 袣芯胁褘虁谢褜, 屑芯褟 褌褉邪虁胁褍褕泻邪, 泻芯胁褘虁谢褜 斜械褋锌褉懈褞虁褌薪邪褟,                     | 袗褎~袗褎 | 1/2 | xix/nikitin/nikit-130         |     317 |
| 胁 褋懈薪懈褏 斜褉褞虁泻邪褏 泻懈褌邪虁泄褋泻懈褏 / 懈 胁 褎褍褌斜芯虁谢泻械 褋 写懈薪邪虁屑芯胁褋泻懈屑 芦袛[褝虁]禄. | 袗薪~袗薪 | 2/5 | xx/rein/rein-143              |     280 |

#+begin_src python :results value
  import sqlite3

  from bs4 import BeautifulSoup

  from velimir.parsers import extract_lines
  from velimir.io import read_poem_xml
  from velimir.validation import meters_to_str
  from velimir.ml_loader import MeterClassRegistry
  from velimir.settings import PREDICTION_DB_PATH

  MeterClassRegistry.initialize()

  conn = sqlite3.connect(PREDICTION_DB_PATH)

  res = conn.execute("""
      SELECT poem_path, line_idx, meter_class_target, meter_class_pred
      FROM predictions
      WHERE meter_class_target <> meter_class_pred
      ORDER BY RANDOM()
      LIMIT 50
  """)

  examples = [("孝械泻褋褌", "袦械褌褉 (泻芯褉锌褍褋)", "笑械蟹褍褉邪 (泻芯褉锌褍褋)", "袩褉械写褋泻邪蟹邪薪薪褘泄 屑械褌褉", "袩褉械写褋泻邪蟹邪薪薪邪褟 褑械蟹褍褉邪", "肖邪泄谢")]

  while row := res.fetchone():
      poem_path, line_id, target_class, pred_class = row
      
      target_class, pred_class = map(MeterClassRegistry.int_to_mc, (target_class, pred_class))

      poem_xml = read_poem_xml(poem_path)
      soup = BeautifulSoup(poem_xml, "xml")
      lines = list(extract_lines(soup))

      line = lines[line_id]

      caesura_to_str = lambda c: "-".join(map(str, c.caesura)) or '-'

      examples.append((line.text, meters_to_str(target_class), caesura_to_str(target_class), meters_to_str(pred_class), caesura_to_str(pred_class), poem_path))

  return examples
#+end_src

#+RESULTS:
| 孝械泻褋褌                                                            | 袦械褌褉 (泻芯褉锌褍褋) | 笑械蟹褍褉邪 (泻芯褉锌褍褋) | 袩褉械写褋泻邪蟹邪薪薪褘泄 屑械褌褉 | 袩褉械写褋泻邪蟹邪薪薪邪褟 褑械蟹褍褉邪 | 肖邪泄谢                        |
| 小械谐芯虁写薪褟 / 薪邪虁写芯 / 泻邪褋褌械虁褌芯屑                                        | 袛泻            | -               | 携                  | -                    | xx/majakovsky/majak8-091    |
| 褋卸懈屑邪虁谢芯褋褜 褋械虁褉写褑械 胁 泻褍谢邪虁泻 懈谢懈 胁 泻芯虁屑                               | 袛泻            | -               | 袗褎~袗褎              | 1/2                  | xx/petrov/petrov-634        |
| 袘褘虁谢芯 斜褘 褍 屑械薪褟虁 褍褋械虁褉写褜械,                                          | 袗泻            | -               | 袛泻                 | -                    | xx/sedakova/sedak-347       |
| 效褌芯 褋褌褉褍虁薪邪 芯虁斜芯褉胁械虁褌褋褟!..                                          | 携             | -               | 啸                  | -                    | xx/samoilov/samoi-553       |
| 懈 泻邪虁褌懈褌褋褟虁 锌芯 卸械虁谢褌芯泄 褍虁谢懈褑械                                        | 携             | -               | 孝泻                 | -                    | xx/sapgir/sapgr-728         |
| 袠 胁芯 屑薪械虁 薪邪泻懈锌邪虁械褌 蟹邪虁胁懈褋褌褜                                        | 袛泻            | -               | 孝泻                 | -                    | xx/elagin/elag-188          |
| 袪邪褋褑胁械褌褍虁 谢懈 蟹邪虁薪芯胁芯 褟虁.                                            | 袛泻            | -               | 袗褎                 | -                    | xx/emigration/emigr-1623    |
| 袠 薪械 褌褘虁 谢懈,                                                      | 袗薪            | -               | 袛泻                 | -                    | xx/korvin/korvn-042         |
| 袙 褌芯锌芯褉褘虁 锌芯褉邪虁 薪邪屑 锌芯谐芯虁褋褌褘 斜褉邪褌褜.                                 | 袛泻            | -               | 啸~啸                | 1/2                  | xx/oberiu/oberi-74          |
| 袘褍虁写褍褔懈 写芯谐邪虁写谢懈胁褘屑 芯褌 锌褉懈褉芯虁写褘                                     | 袗泻            | -               | 孝泻                 | -                    | xx/tixonov/tixon-133        |
| 孝邪虁泻 屑褘 褋泻邪泻邪虁谢懈 胁写胁芯械虁屑 薪邪 写芯锌褉芯虁褋 褍 锌芯写薪芯虁卸懈褟 谐芯虁褉.                  | 袛             | -               | 袛泻                 | -                    | xx/xlebnikov/xlebn-143      |
| 袩褉褘卸泻芯虁屑 锌谢芯胁褑邪虁 褋谢械褌械虁谢 袥械谐邪薪褜械虁...                                 | 袛泻            | -               | 孝泻                 | -                    | xx/zenkevich/zenk2-017      |
| 携 / 薪邪 褋谢芯虁卸薪褘褏 邪谐懈虁褌胁芯锌褉芯虁褋邪褏 褉芯虁褋,                                 | 袛泻            | -               | 袗泻                 | -                    | xx/majakovsky/majak2-28     |
| 袨褌 斜芯谢芯虁褌薪芯谐芯 蟹谢芯虁谐芯 写褘虁屑邪,                                         | 袥             | -               | 袛泻                 | -                    | xx/cvetaeva/cvet1-567       |
| 袥褞斜芯虁胁褜 懈 薪械虁卸薪芯褋褌褜 褌邪褟虁,                                           | 袛泻            | -               | 携                  | -                    | xx/kumach/kumach-049        |
| 袠虁 斜械褋褋屑褘虁褋谢械薪薪褘虁泄 袨褉褎械虁泄                                            | 啸             | -               | 孝泻                 | -                    | xx/stratanovskiy/strat-027  |
| 袠 泻芯虁薪褌褉写褍斜谢懈泻邪虁褌薪褘泄 邪泻泻褉械写懈褌懈虁胁.                                   | 袛泻            | -               | 袗泻                 | -                    | xx/selvinsky/selv2-022      |
| 袨褋褌邪虁谢懈褋褜 褌芯虁谢褜泻芯 写械虁褌懈.                                            | 携             | -               | 袛泻                 | -                    | xx/gercyk/gerc-144          |
| 芦袗泄 褋锌邪褋懈虁斜芯, 屑懈虁谢褘械, 薪邪 写芯斜褉芯虁屑 褋谢芯胁褑械,                            | 孝泻            | -               | 袗泻                 | -                    | xx/satirikon/satir-054      |
| 薪芯 褍卸械虁 褕懈虁褉械 锌芯写胁芯虁蟹 褋谢懈胁芯虁胁芯谐芯 褋芯虁泻邪                                | 袛泻            | -               | 小                  | -                    | xx/cvetkov/cvetk-176        |
| 袠 谢褍薪邪虁, 懈屑 芯写械虁褌邪,                                                | 袗薪            | -               | 啸                  | -                    | xx/avantgarde/avan-1445     |
| 袝蟹写懈褕褜, 械虁蟹写懈褕褜,                                                  | 袗薪            | -               | 啸                  | -                    | xx/stratanovskiy/strat-259  |
| 协虁褌芯, 泻邪泻 锌褉械虁卸写械, 褋薪芯虁胁邪 胁械褋薪邪虁.                                    | 袛泻            | -               | 袛~袛                | 1/2                  | xx/pasternak/paster-287     |
| 袛芯卸写懈虁 胁锌械褉胁褘虁械 薪邪 褉懈虁褋泻 懈 薪邪 芯虁褖褍锌褜,                                | 袛泻            | -               | 孝泻                 | -                    | xx/1920/1920-818            |
| 袧芯虁 锌械褉械写 褋屑械虁褉褌褜褞 芯薪邪虁 褋谢邪写泻邪虁...                                   | 袛泻            | -               | 携~携                | 1/2                  | xx/oleynikov/olein-099      |
| 孝邪 胁械谢懈褌 胁褋械屑 谢褞斜懈虁褌懈,                                            | 小             | -               | 袗薪                 | -                    | xviii/trediakovsky/tred-070 |
| 小褌芯褉芯薪懈虁褌械褋褜!                                                     | 袗薪            | -               | 啸                  | -                    | xx/briusov/brius-1063       |
| 袣芯薪械虁褔薪芯 褋锌械虁褉 褟 褍 褌械斜褟虁 褔邪褋褘虁                                       | 孝泻            | -               | 携                  | -                    | xx/xvostenko/xvost-340      |
| 薪邪写懈虁褉                                                            | 袗褎            | -               | 携                  | -                    | xx/gorbanevskaya/grbnv-526  |
| 袩褉芯虁褖邪泄 -- 斜褍虁写褜 蟹写芯褉芯虁胁邪!                                          | 啸             | -               | 啸*                 | -                    | xix/grigoriev/grig-075      |
| 袩谢邪虁泻邪褌褜, 泻邪泻 芯斜 协写械虁屑械 袝虁胁邪!                                       | 袗泻            | -               | 袛泻                 | -                    | xx/avantgarde/avan-1143     |
| 啸褉邪虁锌芯懈虁写芯谢褘虁 蟹邪褉卸邪虁谢懈 褌邪虁泻                                           | 啸             | -               | 袛泻                 | -                    | xx/sapgir/sapgr-763         |
| 泻褉芯虁胁褜 褋胁械褉褌褘胁邪谢邪褋褜 胁 褕邪虁褉懈泻懈 懈蟹 锌褘虁谢懈虁.                             | 孝泻            | -               | 携                  | -                    | xx/voznesensky/vozns-242    |
| 孝褍屑邪虁薪 薪邪胁懈虁褋,                                                     | 携             | -               | 袛泻                 | -                    | xx/china/china-169          |
| 袚芯胁芯褉褟虁 褋褌懈褏邪虁屑懈, 屑褘 泻褉褍虁锌薪芯 胁谢懈虁锌谢懈,                                | 袛泻            | -               | 袥                  | -                    | xx/zelchenko/zel-027        |
| 小褍褉芯虁胁 斜褉褞褏邪虁褌芯褋褌懈虁 锌械泄蟹邪虁卸 芯褌械虁褔械褋泻懈泄,                               | 携             | -               | 携~携                | 1/2                  | xx/bozhnev/bozhn-132        |
| 袗 锌械褉械卸懈胁邪虁薪褜褟 褋褌懈褏懈虁泄薪芯谐芯 褌械虁谢邪?                                   | 袛泻            | -               | 袗褎                 | -                    | xx/moritz/mrtz-0749         |
| 袝褋谢懈 褏芯虁褔械褕褜 胁 袠懈褋褍虁褋芯胁芯泄 泻芯褉芯虁薪械 褏芯写懈虁褌褜,                           | 孝泻            | -               | 袗泻                 | -                    | xx/mandelstamm/mandl-346    |
| 孝芯虁谢褜泻芯 胁褋械虁 写芯谐薪邪虁褌褜 薪械 屑芯虁卸械褌, 芦锌芯虁写芯卸写懈虁, 褋褘薪芯虁泻, 屑械薪褟虁禄,             | 啸             | -               | 袛泻                 | -                    | xx/adamovic/adam-116        |
| 屑薪械 卸懈虁褌褜 胁 薪械屑 锌褉懈械虁谢芯褋褜, 褔褌芯 袘芯虁谐褍 -- / 芦褉邪虁蟹薪芯芯斜褉邪虁蟹薪芯褋褌褜禄 屑芯谢懈虁褌胁, | 袛泻            | -               | 袗泻                 | -                    | xx/ryzhiy/ryzh-008          |
| 斜褘谢邪虁 褟 胁 袟袗虁袚小袝                                                   | 携             | -               | 啸*                 | -                    | xx/xarms/xarms-107          |
| 袙褋械谐写邪虁-Unvolle虁ndete                                              | 袗褎            | -               | 携                  | -                    | xx/aygi/aygi-258            |
| 袨虁薪 芯斜褗褟胁懈虁谢 懈虁褋褌懈薪褍 屑懈虁褉邪 胁 胁懈薪械虁,                                   | 袛泻            | -               | 袗褎                 | -                    | xx/1920/1920-785            |
| 锌芯谢芯虁卸懈褌褜 锌芯虁斜械写懈虁胁褕褍褞虁 泻芯屑邪虁薪写褍.                                     | 携             | -               | 孝泻                 | -                    | xx/baitov/bait-344          |
| 袝写懈虁薪褋褌胁械薪薪芯, 泻邪虁卸械褌褋褟, 褔褌芯虁 薪械 褍褋褌邪虁谢 芯薪, --                        | 袗褎            | -               | 孝泻                 | -                    | xx/simonov/smnv-184         |
| 小谢懈虁褕泻芯屑 谢械谐泻芯虁, 泻邪泻 屑薪械 锌懈虁褕械褌褋褟, 褋谢懈虁褕泻芯屑 谢械谐泻芯虁                    | 袛             | -               | 袛泻                 | 1/2                  | xx/mironov/miron-258        |
| 懈 褋邪屑邪虁 薪邪写械虁卸写邪 褍斜懈胁邪虁械褌.                                          | 孝泻            | -               | 啸                  | -                    | xx/sedakova/sedak-351       |
| 袦懈薪屑邪虁褕                                                           | 携             | -               | 啸                  | -                    | xx/saburov/sabur-622-1      |
| 褌褘褔邪 胁褋锌褘虁褕泻邪屑懈,                                                  | 袗薪            | -               | 啸                  | -                    | xx/kirsanov/kirsan-191      |
| 袨薪 薪械 锌芯虁薪褟谢, 泻褌芯 蟹邪卸械虁谐 胁邪褋,                                      | 孝泻            | -               | 袛泻                 | -                    | xx/esenin/es4-172           |
